# Intermediate Python

Texas A&M University High Performance Research Computing

Texas A&M University Engineering Studio for Advanced Instruction and Learning

Texas A&M Engineering Experiment Station Educating Generations


## "Data Handling"
Learn how to use Use Python Pandas library for data manipulation

# Pandas Module

Reminder: You should import a module *once*, usually at the beginning of the notebook.

Execute this cell to bring in `pandas` and `numpy` functions.

In [1]:
#don't forget to
import pandas
import numpy

# Missing data

Sometimes a dataset will have missing data for some positions. In Python, these are usually represented with `NaN` or *Not a Number*.

* `numpy` module provides a data value `numpy.nan`.

Inserting rows or columns into a DataFrame without specifying any values causes the missing values to be filled with `NaN`.

## Example 0

Causing `NaN` to appear by inserting new elements in the `index`.

Causing `NaN` to appear by manually specifying `numpy.nan`.

Execute the cell to create a DataFrame with missing data.

In [2]:
nan_df = pandas.DataFrame(
    numpy.random.randn(4, 1),
    index=["a", "c", "e", "g"],
    columns=["c1"],
)
nan_df = nan_df.reindex(["a", "b", "c", "e", "g", "h"])
nan_df["c2"] = 1
nan_df = nan_df.reindex(["a", "b", "c", "d", "e", "f", "g", "h"])
nan_df.loc["a", "c2"] = numpy.nan
display(nan_df)

         c1   c2
a -0.407048  NaN
b       NaN  1.0
c -0.219450  1.0
d       NaN  NaN
e -0.350237  1.0
f       NaN  NaN
g  1.185802  1.0
h       NaN  1.0

# Dropping Missing Data
You can drop rows or columns that contain any `NaN` values.
```
new_df = df.dropna()
```

The important keyword arguments are

* `how`  specifies what the rule is for dropping a row or column.
 * options are `'any'` and `'all'`
* `axis` which specifies if you are dropping rows or columns.
  * default is rows.

## Example 1

Dropping rows that have `NaN` values.

Execute the cells to see what happens.

In [3]:
display(nan_df.dropna(how='all') )

         c1   c2
a -0.407048  NaN
b       NaN  1.0
c -0.219450  1.0
e -0.350237  1.0
g  1.185802  1.0
h       NaN  1.0

In [4]:
display(nan_df.dropna(how='any') )

         c1   c2
c -0.219450  1.0
e -0.350237  1.0
g  1.185802  1.0

## Exercise 1
Create a DataFrame containing a column of numeric data and a column of `NaN`.

Use the `axis` keyword argument to drop the column of `NaN`.

In [5]:
#your code here

<details><summary><p style="padding: 10px; border: 2px solid;"><big>Click here to see solution</big></p></summary>
<p>

    
```
nan_df= pandas.DataFrame(
    {
      'a': numpy.full(5, 1.0      ),
      'b': numpy.full(5, numpy.nan)
    }
)
display(nan_df)
print()
display(nan_df.dropna(axis=1))

```
</p>
</details>

# Replacing Missing Data

Several DataFrame return methods create a new dataframe that has the same values except the `NaN`s have been sytematically replaced with something else.

## Replace with a Specified Value

The DataFrame *method* `fillna()` can replace the `NaN` values with a specified value.

The regular argument is the value to insert. To assign different values to different columns, use a dictionary or `Series` with column labels.

```
new_df = df.fillna( value )
new_df = df.fillna( {column:value, ...} )
```

## Example 2
Fill all `NaN`s with constant value *zero*.

Execute the cells to see what happens.

In [6]:
# build dataframe with NaN
nan_df = pandas.DataFrame(
    numpy.random.randn(4, 1),
    index=["a", "c", "e", "g"],
    columns=["c1"],
)
nan_df = nan_df.reindex(["a", "b", "c", "e", "g", "h"])
nan_df["c2"] = 1
nan_df = nan_df.reindex(["a", "b", "c", "d", "e", "f", "g", "h"])
nan_df.loc["a", "c2"] = numpy.nan
display(nan_df)

         c1   c2
a  0.269136  NaN
b       NaN  1.0
c -0.972351  1.0
d       NaN  NaN
e  1.866735  1.0
f       NaN  NaN
g  2.784477  1.0
h       NaN  1.0

Using `fillna` with a constant value.

In [7]:
display(nan_df.fillna(0))

         c1   c2
a  0.269136  0.0
b  0.000000  1.0
c -0.972351  1.0
d  0.000000  0.0
e  1.866735  1.0
f  0.000000  0.0
g  2.784477  1.0
h  0.000000  1.0

## Exercise 2

Using the `nan_df` DataFrame from Example 2:
* Compute the `mean()` of each column.

* Fill the `NaN`s of each column with the mean value of that column. (leave the original unchanged).

* Display.

Hint: the `mean()` DataFrame method produces a `Series` with column labels.

<details><summary><p style="padding: 10px; border: 2px solid;"><big>Click here to see solution</big></p></summary>
<p>

    
```
# dictionary style
filled = nan_df.fillna(
    {
        'c1':nan_df['c1'].mean(),
        'c2':nan_df['c2'].mean(),
    }
)

# Series style
filled = nan_df.fillna(nan_df.mean())

display(filled)

```
</p>
</details>

## Replace with Nearby Values
The `fillna` *method* can also replace `NaN` with nearby values, using the
keyword argument `method`. Options include:

* `'ffill'` - *forward fill* - propagate a valid observation forwards

* `'bfill'` - *backward fill* - propagate a valid observation backwards

The `interpolate` *method* can replace `NaN` with nearby values, using the keyword argument `method`. Options include:

* `'index'` - fills values proportional to the difference between row *labels* (assuming the row labels are numeric).

* `'linear'` - fills values proportional to the difference between row *positions* (ignoring the index).

## Example 3
Using `fillna` with the `method` keyword argument.

Execute the cells to see what happens.

In [8]:
# build dataframe with NaN
nan_df = pandas.DataFrame(
    numpy.random.randn(4, 1),
    index=["a", "c", "e", "g"],
    columns=["c1"],
)
nan_df = nan_df.reindex(["a", "b", "c", "e", "g", "h"])
nan_df["c2"] = 1
nan_df = nan_df.reindex(["a", "b", "c", "d", "e", "f", "g", "h"])
nan_df.loc["a", "c2"] = numpy.nan
display(nan_df)

         c1   c2
a  1.709827  NaN
b       NaN  1.0
c -0.090568  1.0
d       NaN  NaN
e -0.803460  1.0
f       NaN  NaN
g  0.725170  1.0
h       NaN  1.0

In [9]:
display(nan_df.fillna(method="ffill"))

/tmp/job.200202/ipykernel_17409/2232708055.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  display(nan_df.fillna(method="ffill"))

         c1   c2
a  1.709827  NaN
b  1.709827  1.0
c -0.090568  1.0
d -0.090568  1.0
e -0.803460  1.0
f -0.803460  1.0
g  0.725170  1.0
h  0.725170  1.0

In [10]:
display(nan_df.fillna(method="bfill"))

/tmp/job.200202/ipykernel_17409/1595864976.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  display(nan_df.fillna(method="bfill"))

         c1   c2
a  1.709827  1.0
b -0.090568  1.0
c -0.090568  1.0
d -0.803460  1.0
e -0.803460  1.0
f  0.725170  1.0
g  0.725170  1.0
h       NaN  1.0

## Exercise 3

Create a `DataFrame` or `Series` that has a numeric index and numeric data (with some `NaN`s).
* The index is *not* an arithmetic sequence.
* E.g. a polynomial sequence or random sequence.

Try `interpolate` with the `linear` and `index` methods. Do you get different results?

Join all three versions together as columns of a DataFrame and display.

In [11]:
#your code here

<details><summary><p style="padding: 10px; border: 2px solid;"><big>Click here to see solution</big></p></summary>
<p>

    
```

#build the numeric Series with NaNs
values=numpy.linspace(0,25,6)
labels=numpy.linspace(0,5,6)**2
values[1::3]=numpy.nan
numeric_series = pandas.Series(values, index=labels)

#add to DataFrame
numeric_df = numeric_series.to_frame(name="missing")

#interpolate and add to DataFrame
numeric_df['linear'] = numeric_series.interpolate(method="linear")
numeric_df['index'] = numeric_series.interpolate(method="index")

display(numeric_df)

```
</p>
</details>

# Handle Duplicate Data
Sometimes measurements are repeated, with new measurements meant to replace old ones.

In that case, the dataframe may contain duplicate rows; it's our job to remove them.

## Checking Duplicate Data


The DataFrame *method* `duplicated()` checks for duplicate rows. The argument specifies which columns to check. You can check the whole DataFrame, or just certain columns.
```
dataframe.duplicated()
dataframe.duplicated(column)
dataframe.duplicated([column, ...])
```

The DataFrame method `duplicated()` returns a series of booleans that mark the duplicate rows.
```
boolean_series = dataframe.duplicated()
```
By default, for each set of duplicated rows, the first occurrence is set to `False` and all others to `True`. I.e. The "second" one is the duplicate.

## Example 4

Checks if rows appears elsewhere with the same values

Execute the cells to see what happens.

In [12]:
duplicates_df = pandas.DataFrame(
    {
        'c1':[1,1,2,2,3,3],
        'c2':[4,4,4,5,5,5],
    }
)
display(duplicates_df)

   c1  c2
0   1   4
1   1   4
2   2   4
3   2   5
4   3   5
5   3   5

In [13]:
# series of booleans
duplicated_mask=duplicates_df.duplicated()
print(duplicates_df.duplicated())

0    False
1     True
2    False
3    False
4    False
5     True
dtype: bool

In [14]:
# filter the dataframe using the mask
print("duplicates")
display(duplicates_df[ duplicated_mask])
print()
# and its opposite
print("unique rows")
display(duplicates_df[~duplicated_mask])

duplicates

   c1  c2
1   1   4
5   3   5

unique rows

   c1  c2
0   1   4
2   2   4
3   2   5
4   3   5

## Exercise 4
Use the `duplicates_df` from Example 4.

Check for duplicate values, but just check the first column `'c1'`. Filter the DataFrame and display.

Which rows are marked as duplicate? Is it different than Example 4?

In [15]:
#your code here

<details><summary><p style="padding: 10px; border: 2px solid;"><big>Click here to see solution</big></p></summary>
<p>

    
```
mask=duplicates_df.duplicated('c1')
display(duplicates_df[mask])

```
</p>
</details>

## Removing Duplicates

The DataFrame *method* `drop_duplicates()` drops for duplicate rows and returns a new dataframe.

The logic is the same as before. The argument specifies which columns to check. The first occurance of each duplicate row is kept.

```
new_df = dataframe.drop_duplicates()
```

## Example 5
 Drop duplicate rows

In [16]:
display(duplicates_df.drop_duplicates() )
#this should look the same as the "unique rows" of Example 4

   c1  c2
0   1   4
2   2   4
3   2   5
4   3   5

## Exercise 5

From the provided DataFrame, drop all rows with the same `'name'` value *except* the most **recent** one. Display.

* Hint: sort the `'date'` column.

In [17]:
records = pandas.DataFrame( [
    {"date":numpy.datetime64("2022-03-15"), "name": "Bob" },
    {"date":numpy.datetime64("2022-03-17"), "name": "Mark"},
    {"date":numpy.datetime64("2022-04-01"), "name": "Bob" },
    {"date":numpy.datetime64("2022-04-02"), "name": "Mia" },
    {"date":numpy.datetime64("2022-04-30"), "name": "K22" },
    {"date":numpy.datetime64("2022-05-09"), "name": "Mark"},
    {"date":numpy.datetime64("2022-05-11"), "name": "K22" },
    {"date":numpy.datetime64("2022-07-02"), "name": "Mia" },
    {"date":numpy.datetime64("2022-08-16"), "name": "Bob" },
    {"date":numpy.datetime64("2022-12-25"), "name": "Nick"}
] )
#your code here

<details><summary><p style="padding: 10px; border: 2px solid;"><big>Click here to see solution</big></p></summary>
<p>

    
```
records = pandas.DataFrame( [
    {"date":numpy.datetime64("2022-03-15"), "name": "Bob" },
    {"date":numpy.datetime64("2022-03-17"), "name": "Mark"},
    {"date":numpy.datetime64("2022-04-01"), "name": "Bob" },
    {"date":numpy.datetime64("2022-04-02"), "name": "Mia" },
    {"date":numpy.datetime64("2022-04-30"), "name": "K22" },
    {"date":numpy.datetime64("2022-05-09"), "name": "Mark"},
    {"date":numpy.datetime64("2022-05-11"), "name": "K22" },
    {"date":numpy.datetime64("2022-07-02"), "name": "Mia" },
    {"date":numpy.datetime64("2022-08-16"), "name": "Bob" },
    {"date":numpy.datetime64("2022-12-25"), "name": "Nick"}
] ).sort_values(by='date',ascending=False).drop_duplicates("name")
# inserting the steps above as a method chain
display(records)

```
</p>
</details>

# Merging DataFrames

Merging data means:
  
1.   You have two DataFrames.
2.   Pick a rule for deciding which rows in the dataframes *correspond*.
 * E.g., if they have the same value in a particular column
3. Pick a rule for deciding which rows and columns to keep.

The rules may seem familiar if you have heard of SQL, which is a database language.

## Example 6
These two datasets have a column in common: `'c1'`.

Some of the `'c1'` values (`'a' 'b' 'c'`) appear in both DataFrames. Others (`'d' 'e'`) only appear in one.

In [18]:
df1 = pandas.DataFrame({'c1': ['a','b','c','d'],
                    'c2':[12.0, 23.2, 56, 45.4]})
display(df1)

  c1    c2
0  a  12.0
1  b  23.2
2  c  56.0
3  d  45.4

In [19]:
df2 = pandas.DataFrame({'c1': ['a','b','c','e'],
                    'c3':[9.5, 37.0, 77,38.9]})
display(df2)

  c1    c3
0  a   9.5
1  b  37.0
2  c  77.0
3  e  38.9

## Pandas Merge
The pandas function `merge()` function takes two DataFrames as its argument, and returns a new one.
```
new_df = pandas.merge( df, df )
```

Its important keyword arguments are:
* `on` = a column that the DataFrames have in common
* `how` = the rule for which rows to keep

## Example 7

Four different ways of combining these datasets.

In [20]:
# SQL left join
pandas.merge(df1, df2, on='c1', how='left')

  c1    c2    c3
0  a  12.0   9.5
1  b  23.2  37.0
2  c  56.0  77.0
3  d  45.4   NaN

In [21]:
# SQL right join
pandas.merge(df1, df2, on='c1', how='right')

  c1    c2    c3
0  a  12.0   9.5
1  b  23.2  37.0
2  c  56.0  77.0
3  e   NaN  38.9

In [22]:
# SQL inner join
pandas.merge(df1, df2, on='c1', how='inner')

  c1    c2    c3
0  a  12.0   9.5
1  b  23.2  37.0
2  c  56.0  77.0

In [23]:
# SQL outer join
pandas.merge(df1, df2, on='c1', how='outer')

  c1    c2    c3
0  a  12.0   9.5
1  b  23.2  37.0
2  c  56.0  77.0
3  d  45.4   NaN
4  e   NaN  38.9

## Exercise 6

Create two dataframes as in "Example 6".

* They must have a column in common and share some (but not all) values in that column.

* They must each have with a column that is unique.

Merge the dataframes, using the `'outer'` strategy.

Deal with any `NaN`s by filling them with nearby values.

In [24]:
#your code here